Taxi/test_billing_functions/web/static/test_v1_execute_doc/charge_refund_expected.json

{
  "accounts": [
    {
      "account_id": 0,
      "agreement_id": "wallet/<project>",
      "created": "2021-10-18T09:00:00.000000+00:00",
      "currency": "RUB",
      "entity_external_id": "staff/<login>",
      "expired": "9999-12-30T23:59:59.999999+00:00",
      "opened": "2021-10-18T09:00:00.000000+00:00",
      "sub_account": "deposit"
    }
  ],
  "doc_update_request": {
    "data": {
      "status_info": {
        "status": "success"
      }
    },
    "doc_id": 1,
    "entry_ids": [
      0
    ],
    "idempotency_key": "finalize",
    "revision": 1,
    "status": "complete"
  },
  "entities": [
    {
      "created": "2021-10-18T09:00:00.000000+00:00",
      "external_id": "staff/<login>",
      "kind": "staff"
    }
  ],
  "entries": [
    {
      "account_id": 0,
      "amount": "100.0",
      "created": "2021-10-18T09:00:00.000000+00:00",
      "details": {
        "method": "charge",
        "operation_type": "refund",
        "transaction_id": "<transaction_id>"
      },
      "doc_ref": "1",
      "entry_id": 0,
      "event_at": "2021-09-05T05:09:14.183135+00:00",
      "idempotency_key": "1",
      "reason": ""
    }
  ],
  "response": {
    "created": "2021-09-05T08:09:14.183135+03:00",
    "data": {
      "account": {
        "agreement_id": "wallet/<project>",
        "currency": "RUB",
        "entity_external_id": "staff/<login>",
        "sub_account": "deposit"
      },
      "amount": "100.0",
      "details": {
        "method": "charge",
        "operation_type": "refund",
        "transaction_id": "<transaction_id>"
      },
      "method": "charge",
      "operation_type": "refund",
      "schema_version": "v1",
      "status_info": {
        "status": "success"
      }
    },
    "doc_id": 1,
    "event_at": "2021-09-05T08:09:14.183135+03:00",
    "external_event_ref": "1",
    "external_obj_id": "agent/coins/<transaction_id>",
    "kind": "arbitrary_wallet",
    "revision": 2,
    "status": "complete"
  }
}
